<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="jedi">JEDI</string>
      <string id="win2k8only">Supported on Windows 7 and later.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>