<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="RSA_DESKTOP">RSA Desktop - Synchronize User Passwords</string>
      <string id="SUPPORTED_VISTA">Windows 7, Windows Vista, or Windows Server 2008</string>
      <string id="LAC_SETTINGS">Local Authentication Settings</string>
      <string id="LAC_PASSWORD_SYNC_METHOD_TITLE">Synchronize User Passwords</string>
      <string id="LAC_PASSWORD_SYNC_METHOD_DESCRIPTION">Specifies the users for whom domain account password changes are automatically synchronized in matching accounts in the RSA Authentication Manager database. You can synchronize password changes for all users, all users except those in a specified group, only users in a specified group, or no users. You also specify whether or not to send the domain name and user name to RSA Authentication Manager instead of just the user name.

Note: If you synchronize password changes only for users in a specified group or all users except those in a specified group, you must enter the name of the group in the Group name field. Enter the group name in the format &lt;domain name or machine name&gt;\&lt;group name&gt;, or for the current machine, enter .\&lt;group name&gt;.</string>
      <string id="LAC_PASSWORD_SYNC_METHOD_MESSAGE">Select the users to synchronize.</string>
      <string id="LAC_PASSWORD_SYNC_METHOD_LABEL">Synchronize:</string>
      <string id="LAC_PASSWORD_SYNC_METHOD_OFF">Off</string>
      <string id="LAC_PASSWORD_SYNC_METHOD_ALL">All users</string>
      <string id="LAC_PASSWORD_SYNC_METHOD_IN_GROUP">Users in</string>
      <string id="LAC_PASSWORD_SYNC_METHOD_EXCEPT">All users except</string>
      <string id="LAC_PASSWORD_SYNC_GROUP_MESSAGE1">Enter the name of the group to synchronize in the format</string>
      <string id="LAC_PASSWORD_SYNC_GROUP_MESSAGE2">&lt;domain name or machine name&gt;\&lt;group name&gt;.</string>
      <string id="LAC_PASSWORD_SYNC_GROUP_MESSAGE3">For example: CORP\SecurID Users</string>
      <string id="LAC_PASSWORD_SYNC_GROUP_LABEL">Group name:</string>
      <string id="LAC_DOMAIN_USERNAME_LABEL">Send Domain and User Name to Authentication Manager</string>
      <string id="ADMXMigrator_UnresolvedString">ADMX Migrator encountered a string that is not present in the source ADM string table.</string>
      <string id="ADMXMigrator_NoSupportedOn">ADMX Migrator encountered a policy that does not have a supportedOn value.</string>
    </stringTable>
    <presentationTable>
      <presentation id="LAC_PASSWORD_SYNC_METHOD_TITLE">
        <text>Select the users to synchronize.</text>
        <dropdownList refId="LAC_PASSWORD_SYNC_METHOD_LABEL" noSort="true" defaultItem="0">Synchronize:</dropdownList>
        <text>Enter the name of the group to synchronize in the format</text>
        <text>&lt;domain name or machine name&gt;\&lt;group name&gt;.</text>
        <text>For example: CORP\SecurID Users</text>
        <textBox refId="LAC_PASSWORD_SYNC_GROUP_LABEL">
          <label>Group name:</label>
          <defaultValue>
          </defaultValue>
        </textBox>
        <checkBox refId="LAC_DOMAIN_USERNAME_LABEL">Send Domain and User Name to Authentication Manager</checkBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>