<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="RSA_DESKTOP">RSA Desktop - Local Authentication Prompt</string>
      <string id="LAC_SETTINGS">Local Authentication Settings</string>
      <string id="SUPPORTED_VISTA">Windows 7, Windows Vista, or Windows Server 2008</string>
      <string id="LAC_AUTH_METHOD_TITLE">Label for the Local Authentication Prompt</string>
      <string id="LAC_AUTH_METHOD_DESCRIPTION">Sets the label for the RSA SecurID local authentication logon prompt. The options are Passcode or Password.</string>
      <string id="LAC_AUTH_METHOD_LABEL">Logon label:</string>
      <string id="LAC_AUTH_METHOD_MESSAGE">Select the label you want to display during logon.</string>
      <string id="LAC_AUTH_METHOD_PASSCODE">Passcode</string>
      <string id="LAC_AUTH_METHOD_PASSWORD">Password</string>
      <string id="LAC_CHALLENGE_METHOD_TITLE">Challenge Users</string>
      <string id="LAC_CHALLENGE_METHOD_DESCRIPTION">Defines the users that Authentication Agent challenges for RSA SecurID credentials. You can challenge all users, all users except those in a specified group, only users in a specified group, or no users. You can specify whether or not to send the domain name and user name to RSA Authentication Manager instead of just the user name.

Note: If you challenge only users in a specified group or all users except those in a specified group, you must enter the name of the group in the Group name field. Enter the group name in the format &lt;domain name or machine name&gt;\&lt;group name&gt;, or for the current machine, enter .\&lt;group name&gt;. You must enter a valid group name. If the group name is invalid or does not exist, Authentication Agent challenges all users.</string>
      <string id="LAC_CHALLENGE_METHOD_MESSAGE">Select the users to challenge.</string>
      <string id="LAC_CHALLENGE_METHOD_LABEL">Challenge:</string>
      <string id="LAC_CHALLENGE_METHOD_OFF">Off</string>
      <string id="LAC_CHALLENGE_METHOD_ALL">All users</string>
      <string id="LAC_CHALLENGE_METHOD_IN_GROUP">Users in</string>
      <string id="LAC_CHALLENGE_METHOD_EXCEPT">All users except</string>
      <string id="LAC_CHALLENGE_GROUP_MESSAGE1">Enter the name of the challenge group in the format</string>
      <string id="LAC_CHALLENGE_GROUP_MESSAGE2">&lt;domain name or machine name&gt;\&lt;group name&gt;.</string>
      <string id="LAC_CHALLENGE_GROUP_MESSAGE3">For example: CORP\SecurID Users</string>
      <string id="LAC_CHALLENGE_GROUP_LABEL">Group name:</string>
      <string id="LAC_DOMAIN_USERNAME_LABEL">Send Domain and User Name to Authentication Manager</string>
      <string id="LAC_CHALLENGE_FAIL_OPEN_TITLE">Cache Challenge Settings</string>
      <string id="LAC_CHALLENGE_FAIL_OPEN_DESCRIPTION">Allows Authentication Agent to retrieve the user's challenge setting from a local cache, if the agent cannot determine the user's group membership from the domain controller.

If Authentication Agent cannot find the user's challenge setting in the cache, then you can set one of the following:

• Challenge the user
• Do not challenge the user (allow Windows password)</string>
      <string id="LAC_CHALLENGE_FAIL_OPEN_MESSAGE">Select whether or not to challenge an unknown user.</string>
      <string id="LAC_CHALLENGE_FAIL_OPEN_LABEL1">Challenge</string>
      <string id="LAC_CHALLENGE_FAIL_OPEN_LABEL2">Do not challenge</string>
      <string id="LAC_DA_SERVICE_TITLE">Offline Authentication Service</string>
      <string id="LAC_DA_SERVICE_DESCRIPTION">If you are not using offline authentication, then you can disable it locally on the client. You must disable this setting to prevent offline authentication locally.</string>
      <string id="LAC_RESERVE_PASSWORD_TITLE">Reserve Password</string>
      <string id="LAC_RESERVE_PASSWORD_DESCRIPTION">The reserve password feature is an emergency access method that enables an authorized user to authenticate to a user’s protected computer as that user without entering an RSA SecurID passcode.

To securely establish a reserve password, you generate a hashed value of the reserve password using the RSA Authentication Agent Reserve Password Hash Generation utility that comes with the RSA Authentication Agent. For more information, see the Group Policy Object Template Guide.</string>
      <string id="LAC_RESERVE_PASSWORD_MESSAGE1">Generate a hash value of your reserve password using the</string>
      <string id="LAC_RESERVE_PASSWORD_MESSAGE2">RSA Authentication Agent Reserve Password Hash Generation utility.</string>
      <string id="LAC_RESERVE_PASSWORD_MESSAGE3">Enter the generated hash value in the field below.</string>
      <string id="LAC_RESERVE_PASSWORD_LABEL">
      </string>
      <string id="LAC_PIN_UNLOCK_TITLE">Unlock with RSA SecurID PIN</string>
      <string id="LAC_PIN_UNLOCK_DESCRIPTION">Allows RSA SecurID users to unlock their computers with only an RSA SecurID PIN instead of an RSA SecurID passcode.

You can also change the following settings:

• Specify the number of times users can enter incorrect PINs before they are prompted for a passcode.
• Specify the number of minutes after the computer locks during which users can enter only their PINs to unlock their computers.</string>
      <string id="LAC_PIN_TIMEOUT_MESSAGE">Specify the RSA SecurID PIN time-out.</string>
      <string id="LAC_PIN_TIMEOUT_LABEL">Minutes:</string>
      <string id="LAC_PIN_ATTEMPTS_MESSAGE">Specify the number of attempts allowed to enter an RSA SecurID PIN.</string>
      <string id="LAC_PIN_ATTEMPTS_LABEL">Attempts:</string>
      <string id="ADMXMigrator_UnresolvedString">ADMX Migrator encountered a string that is not present in the source ADM string table.</string>
      <string id="ADMXMigrator_NoSupportedOn">ADMX Migrator encountered a policy that does not have a supportedOn value.</string>
    </stringTable>
    <presentationTable>
      <presentation id="LAC_AUTH_METHOD_TITLE">
        <text>Select the label you want to display during logon.</text>
        <dropdownList refId="LAC_AUTH_METHOD_LABEL" noSort="true" defaultItem="0">Logon label:</dropdownList>
      </presentation>
      <presentation id="LAC_CHALLENGE_METHOD_TITLE">
        <text>Select the users to challenge.</text>
        <dropdownList refId="LAC_CHALLENGE_METHOD_LABEL" noSort="true" defaultItem="0">Challenge:</dropdownList>
        <text>Enter the name of the challenge group in the format</text>
        <text>&lt;domain name or machine name&gt;\&lt;group name&gt;.</text>
        <text>For example: CORP\SecurID Users</text>
        <textBox refId="LAC_CHALLENGE_GROUP_LABEL">
          <label>Group name:</label>
          <defaultValue>
          </defaultValue>
        </textBox>
        <checkBox refId="LAC_DOMAIN_USERNAME_LABEL">Send Domain and User Name to Authentication Manager</checkBox>
      </presentation>
      <presentation id="LAC_CHALLENGE_FAIL_OPEN_TITLE">
        <text>Select whether or not to challenge an unknown user.</text>
        <dropdownList refId="LAC_CHALLENGE_FAIL_OPEN_LABEL1" noSort="true" defaultItem="0">
        </dropdownList>
      </presentation>
      <presentation id="LAC_DA_SERVICE_TITLE" />
      <presentation id="LAC_RESERVE_PASSWORD_TITLE">
        <text>Generate a hash value of your reserve password using the</text>
        <text>RSA Authentication Agent Reserve Password Hash Generation utility.</text>
        <text>Enter the generated hash value in the field below.</text>
        <textBox refId="LAC_RESERVE_PASSWORD_LABEL">
          <label>
          </label>
          <defaultValue>
          </defaultValue>
        </textBox>
      </presentation>
      <presentation id="LAC_PIN_UNLOCK_TITLE">
        <text>Specify the RSA SecurID PIN time-out.</text>
        <decimalTextBox refId="LAC_PIN_TIMEOUT_LABEL" defaultValue="75">Minutes:</decimalTextBox>
        <text>Specify the number of attempts allowed to enter an RSA SecurID PIN.</text>
        <decimalTextBox refId="LAC_PIN_ATTEMPTS_LABEL" defaultValue="3">Attempts:</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>