<policyDefinitions revision="1.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="fullarmor" namespace="FullArmor.Policies.24F4EE81_04F0_4107_A6D0_C5B6D82E46AF" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <supersededAdm fileName="C:\OTEF RSA\Policy Templates\RSA_Authentication_Agent.adm" />
  <resources minRequiredRevision="1.0" />
  <supportedOn>
    <definitions>
      <definition name="SUPPORTED_VISTA" displayName="$(string.SUPPORTED_VISTA)" />
      <definition name="SUPPORTED_NotSpecified" displayName="$(string.ADMXMigrator_NoSupportedOn)" />
    </definitions>
  </supportedOn>
  <categories>
    <category name="RSA_DESKTOP" displayName="$(string.RSA_DESKTOP)" />
    <category name="LAC_SETTINGS" displayName="$(string.LAC_SETTINGS)">
      <parentCategory ref="RSA_DESKTOP" />
    </category>
  </categories>
  <policies>
    <policy name="LAC_AUTH_METHOD_TITLE" class="Machine" displayName="$(string.LAC_AUTH_METHOD_TITLE)" explainText="$(string.LAC_AUTH_METHOD_DESCRIPTION)" presentation="$(presentation.LAC_AUTH_METHOD_TITLE)" key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings">
      <parentCategory ref="LAC_SETTINGS" />
      <supportedOn ref="SUPPORTED_VISTA" />
      <elements>
        <enum id="LAC_AUTH_METHOD_LABEL" valueName="LogonPrompt">
          <item displayName="$(string.LAC_AUTH_METHOD_PASSCODE)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.LAC_AUTH_METHOD_PASSWORD)">
            <value>
              <decimal value="1" />
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy name="LAC_CHALLENGE_METHOD_TITLE" class="Machine" displayName="$(string.LAC_CHALLENGE_METHOD_TITLE)" explainText="$(string.LAC_CHALLENGE_METHOD_DESCRIPTION)" presentation="$(presentation.LAC_CHALLENGE_METHOD_TITLE)" key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings">
      <parentCategory ref="LAC_SETTINGS" />
      <supportedOn ref="SUPPORTED_VISTA" />
      <enabledList>
        <item key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings" valueName="EnableChallenge">
          <value>
            <decimal value="1" />
          </value>
        </item>
      </enabledList>
      <disabledList>
        <item key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings" valueName="EnableChallenge">
          <value>
            <decimal value="0" />
          </value>
        </item>
      </disabledList>
      <elements>
        <enum id="LAC_CHALLENGE_METHOD_LABEL" valueName="ChallengeMode">
          <item displayName="$(string.LAC_CHALLENGE_METHOD_OFF)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.LAC_CHALLENGE_METHOD_IN_GROUP)">
            <value>
              <decimal value="1" />
            </value>
          </item>
          <item displayName="$(string.LAC_CHALLENGE_METHOD_ALL)">
            <value>
              <decimal value="2" />
            </value>
          </item>
          <item displayName="$(string.LAC_CHALLENGE_METHOD_EXCEPT)">
            <value>
              <decimal value="3" />
            </value>
          </item>
        </enum>
        <text id="LAC_CHALLENGE_GROUP_LABEL" valueName="ChallengeGroup" />
        <boolean id="LAC_DOMAIN_USERNAME_LABEL" valueName="SendDomainName" />
      </elements>
    </policy>
    <policy name="LAC_CHALLENGE_FAIL_OPEN_TITLE" class="Machine" displayName="$(string.LAC_CHALLENGE_FAIL_OPEN_TITLE)" explainText="$(string.LAC_CHALLENGE_FAIL_OPEN_DESCRIPTION)" presentation="$(presentation.LAC_CHALLENGE_FAIL_OPEN_TITLE)" key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings">
      <parentCategory ref="LAC_SETTINGS" />
      <supportedOn ref="SUPPORTED_VISTA" />
      <enabledList>
        <item key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings" valueName="FailOpen">
          <value>
            <decimal value="1" />
          </value>
        </item>
      </enabledList>
      <disabledList>
        <item key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings" valueName="FailOpen">
          <value>
            <decimal value="0" />
          </value>
        </item>
      </disabledList>
      <elements>
        <enum id="LAC_CHALLENGE_FAIL_OPEN_LABEL1" valueName="UnknownUserChallenge">
          <item displayName="$(string.LAC_CHALLENGE_FAIL_OPEN_LABEL1)">
            <value>
              <decimal value="1" />
            </value>
          </item>
          <item displayName="$(string.LAC_CHALLENGE_FAIL_OPEN_LABEL2)">
            <value>
              <decimal value="0" />
            </value>
          </item>
        </enum>
      </elements>
    </policy>
    <policy name="LAC_DA_SERVICE_TITLE" class="Machine" displayName="$(string.LAC_DA_SERVICE_TITLE)" explainText="$(string.LAC_DA_SERVICE_DESCRIPTION)" presentation="$(presentation.LAC_DA_SERVICE_TITLE)" key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings" valueName="DisableDAService">
      <parentCategory ref="LAC_SETTINGS" />
      <supportedOn ref="SUPPORTED_VISTA" />
    </policy>
    <policy name="LAC_RESERVE_PASSWORD_TITLE" class="Machine" displayName="$(string.LAC_RESERVE_PASSWORD_TITLE)" explainText="$(string.LAC_RESERVE_PASSWORD_DESCRIPTION)" presentation="$(presentation.LAC_RESERVE_PASSWORD_TITLE)" key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings">
      <parentCategory ref="LAC_SETTINGS" />
      <supportedOn ref="SUPPORTED_VISTA" />
      <enabledList>
        <item key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings" valueName="EnableReservePassword">
          <value>
            <decimal value="1" />
          </value>
        </item>
      </enabledList>
      <disabledList>
        <item key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings" valueName="EnableReservePassword">
          <value>
            <decimal value="0" />
          </value>
        </item>
      </disabledList>
      <elements>
        <text id="LAC_RESERVE_PASSWORD_LABEL" valueName="ReservePassword" />
      </elements>
    </policy>
    <policy name="LAC_PIN_UNLOCK_TITLE" class="Machine" displayName="$(string.LAC_PIN_UNLOCK_TITLE)" explainText="$(string.LAC_PIN_UNLOCK_DESCRIPTION)" presentation="$(presentation.LAC_PIN_UNLOCK_TITLE)" key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings" valueName="EnablePinUnlock">
      <parentCategory ref="LAC_SETTINGS" />
      <supportedOn ref="SUPPORTED_VISTA" />
      <elements>
        <decimal id="LAC_PIN_TIMEOUT_LABEL" valueName="PinLifetime" minValue="1" maxValue="480" />
        <decimal id="LAC_PIN_ATTEMPTS_LABEL" valueName="PinAttempts" minValue="1" maxValue="10" />
      </elements>
    </policy>
  </policies>
</policyDefinitions>