<policyDefinitions revision="1.0" schemaVersion="1.0">
  <policyNamespaces>
    <target prefix="fullarmor" namespace="FullArmor.Policies.D75DEE5A_6A42_4D9A_846E_C549FF50EA88" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <supersededAdm fileName="\\102\share\RSA\Policy Templates\EditedMDX\RSA_Authentication_Agent_Password_Synchronization.adm" />
  <resources minRequiredRevision="1.0" />
  <supportedOn>
    <definitions>
      <definition name="SUPPORTED_VISTA" displayName="$(string.SUPPORTED_VISTA)" />
      <definition name="SUPPORTED_NotSpecified" displayName="$(string.ADMXMigrator_NoSupportedOn)" />
    </definitions>
  </supportedOn>
  <categories>
    <category name="RSA_DESKTOP" displayName="$(string.RSA_DESKTOP)" />
    <category name="LAC_SETTINGS" displayName="$(string.LAC_SETTINGS)">
      <parentCategory ref="RSA_DESKTOP" />
    </category>
  </categories>
  <policies>
    <policy name="LAC_PASSWORD_SYNC_METHOD_TITLE" class="Machine" displayName="$(string.LAC_PASSWORD_SYNC_METHOD_TITLE)" explainText="$(string.LAC_PASSWORD_SYNC_METHOD_DESCRIPTION)" presentation="$(presentation.LAC_PASSWORD_SYNC_METHOD_TITLE)" key="SOFTWARE\Policies\RSA\RSA Desktop\Local Authentication Settings">
      <parentCategory ref="LAC_SETTINGS" />
      <supportedOn ref="SUPPORTED_VISTA" />
      <elements>
        <enum id="LAC_PASSWORD_SYNC_METHOD_LABEL" valueName="PasswordSyncMode">
          <item displayName="$(string.LAC_PASSWORD_SYNC_METHOD_OFF)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.LAC_PASSWORD_SYNC_METHOD_IN_GROUP)">
            <value>
              <decimal value="1" />
            </value>
          </item>
          <item displayName="$(string.LAC_PASSWORD_SYNC_METHOD_ALL)">
            <value>
              <decimal value="2" />
            </value>
          </item>
          <item displayName="$(string.LAC_PASSWORD_SYNC_METHOD_EXCEPT)">
            <value>
              <decimal value="3" />
            </value>
          </item>
        </enum>
        <text id="LAC_PASSWORD_SYNC_GROUP_LABEL" valueName="PasswordSyncGroup" />
        <boolean id="LAC_DOMAIN_USERNAME_LABEL" valueName="SendDomainName" />
      </elements>
    </policy>
  </policies>
</policyDefinitions>